Autodesk.Revit.DB.WorksetKind
Indicates one of the standard kinds of workset (as available in the UI).
Since:
2012

Autodesk.Revit.DB.WorksetKind.UserWorkset
Workset defined by users, including the two default worksets created by Revit

Autodesk.Revit.DB.WorksetKind.StandardWorkset
Workset containing a standard.

Autodesk.Revit.DB.WorksetKind.ViewWorkset
Workset containing a view.

Autodesk.Revit.DB.WorksetKind.FamilyWorkset
Workset containing a family.

Autodesk.Revit.DB.WorksetKind.OtherWorkset
Any workset which is not one of the standard types included in this enum.